Revit 2027 API
CableTrayType.ShapeType Property
 Shape of this cable tray type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CableTrayShape ShapeType { get; }
Public ReadOnly Property ShapeType As CableTrayShape
	Get
public:
property CableTrayShape ShapeType {
	CableTrayShape get ();
}
member ShapeType : CableTrayShape with get
Property Value
CableTrayShape
See Also
Reference
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace